INSERT INTO course(id, credit, name, num_lessons_each_week, department_id) VALUES
('211C0020', 2.5, '数据结构基础', 5, 1),
('211C0010', 2.5, '面向对象程序设计', 5, 1),
('211B0010', 4, '离散数学及其应用', 5, 1),
('211C0070', 2, '面向信息技术的沟通技巧', 4, 1),
('211C0060', 4, '数字逻辑设计', 7, 1),
('21121330', 5, '操作系统', 7, 1),
('21186033', 4.5, '计算机组成', 7, 1),
('211C0080', 2, '信息可视化', 4, 1),
('211C0090', 2.5, '图像信息处理', 5, 1),
('12195510', 1.5, '隧道工程', 3, 1),
('121C0040', 3, '结构力学Ⅰ', 5, 2),
('121C0050', 2, '结构力学Ⅱ', 4, 2),
('121C0030', 2.5, '建筑材料', 5, 2);
