INSERT INTO course(id, credit, name, num_lessons_each_week, department_id, intro) VALUES
('211C0020', 2.5, '数据结构基础', 5, 1, '一门叫FDS的课'),
('211C0010', 2.5, '面向对象程序设计', 5, 1, '一门叫OOP的课'),
('211B0010', 4, '离散数学及其应用', 5, 1, '一门叫离散的课'),
('211C0070', 2, '面向信息技术的沟通技巧', 4, 1, '一门叫面向翁恺的课'),
('211C0060', 4, '数字逻辑设计', 7, 1, '一门叫数逻的课'),
('21121330', 5, '操作系统', 7, 1, '一门叫OS的课'),
('21186033', 4.5, '计算机组成', 7, 1, '一门叫计组的课'),
('211C0080', 2, '信息可视化', 4, 1, '一门叫可视化的课'),
('211C0090', 2.5, '图像信息处理', 5, 1, '一门叫图像信息处理的课'),
('12195510', 1.5, '隧道工程', 3, 1, '一门不知道什么课'),
('121C0040', 3, '结构力学Ⅰ', 5, 2, '一门叫结构力学1的课'),
('121C0050', 2, '结构力学Ⅱ', 4, 2, '一门叫结构力学2的课'),
('121C0030', 2.5, '建筑材料', 5, 2, '一门不是我们专业的课');
